Configuration/Documents/бит_ум_ОтчетностьПоИР.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_ум_ОтчетностьПоИР</Name>
			<BasedOn>
				<xr:Item>Document.ПриемНаРаботу</xr:Item>
				<xr:Item>Document.Увольнение</xr:Item>
				<xr:Item>Catalog.Сотрудники</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бит_ум_ВыполненныеДействия</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ум_ВидыСобытийПоИР</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Comment>Краткий перечень сотрудников, включенных в документ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оформил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВсеВыполнено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьРуководителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПодписиРуководителя</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеПодписи</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтролирующийОрган</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ум_ГосударственныеОрганы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Действия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВыполняемыеДействия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючСвязи</Name>
							<Comment>(служебный)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Действие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ум_ДействияПоСобытиям</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выполнено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВыполнения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеПараметрыПечати</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючСвязи</Name>
							<Comment>(служебный)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ум_ДополнительныеПараметрыПечати</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ум_ДополнительныеПараметрыПечати</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеЗначениеПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеЗначение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Configuration/InformationRegisters/бит_ум_ВыполненныеДействия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_ум_ВыполненныеДействия</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Выполнено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ум_ДействияПоСобытиям</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Configuration/Enums/бит_ум_ВидыСобытийПоИР.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ум_ВидыСобытийПоИР</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Прибытие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемНаРаботу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Увольнение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Убытие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Configuration/Documents/бит_ум_ОтчетностьПоИР/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий
	
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	// Сбор данных сотрудников
	СотрудникиКраткийСостав = Новый Массив;
	
	// Проверим, все ли действия выполнены
	ФлагВсеВыполнено = Истина;
	
	Для Каждого СтрокаТабличнойЧасти Из ВыполняемыеДействия Цикл
		
		СотрудникиКраткийСостав.Добавить(СтрокаТабличнойЧасти.Сотрудник);
		
		Если НЕ СтрокаТабличнойЧасти.Выполнено Тогда
			ФлагВсеВыполнено = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	КраткийСоставДокумента = ЗарплатаКадры.КраткийСоставСотрудников(СотрудникиКраткийСостав, Дата);
	
	ВсеВыполнено = ФлагВсеВыполнено; 
	
	ДатаСобытия = Дата;
	
	Действия = СтрСоединить(ОбщегоНазначенияКлиентСервер.СвернутьМассив(ВыполняемыеДействия.ВыгрузитьКолонку(
		"Действие")), ", ");
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	Если ДанныеЗаполнения <> Неопределено Тогда
		
		Если ТипДанныхЗаполнения <> Тип("Структура")
			И Метаданные().ВводитсяНаОсновании.Содержит(ДанныеЗаполнения.Метаданные()) Тогда
			ДокументОснование = ДанныеЗаполнения;
		ИначеЕсли ТипДанныхЗаполнения = Тип("Структура")
			И ДанныеЗаполнения.Свойство("Основание")
			И Метаданные().ВводитсяНаОсновании.Содержит(ДанныеЗаполнения.Основание.Метаданные()) Тогда
			ДокументОснование = ДанныеЗаполнения.Основание;
		КонецЕсли;

		Если ДокументОснование <> Неопределено Тогда
			ЗаполнитьПоДокументуОснованию(ДокументОснование);
		КонецЕсли;
		
	КонецЕсли;
	
	ЗарплатаКадры.ЗаполнитьЗначениеРеквизитаОрганизацияПриОднофирменномУчете(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПараметрыПроведения = ПолучитьДанныеДляПроведения(Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияПоРегистрам(ПараметрыПроведения, Отказ);

КонецПроцедуры

#КонецОбласти
	
#Область СлужебныеПроцедурыИФункции

Процедура ДвиженияПоРегистрам(ПараметрыПроведения, Отказ)
	
	Движения.бит_ум_ВыполненныеДействия.Записывать = Истина;
	
	Для Каждого Строка Из ПараметрыПроведения.ВыполненныеДействия Цикл
		ЗаполнитьЗначенияСвойств(Движения.бит_ум_ВыполненныеДействия.Добавить(), Строка);
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьДанныеДляПроведения(Отказ)
		
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Регистратор", ЭтотОбъект.Ссылка);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОтчетностьПоИР.Ссылка.Дата КАК Период,
	|	ОтчетностьПоИР.Ссылка.Организация,
	|	ОтчетностьПоИР.Сотрудник,
	|	ОтчетностьПоИР.Сотрудник.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ОтчетностьПоИР.Действие,
	|	ОтчетностьПоИР.Выполнено,
	|	ОтчетностьПоИР.ДатаВыполнения
	|ИЗ
	|	Документ.бит_ум_ОтчетностьПоИР.ВыполняемыеДействия КАК ОтчетностьПоИР
	|ГДЕ
	|	ОтчетностьПоИР.Ссылка = &Регистратор";
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ДанныеДляПроведения = Новый Структура; 
	
	ДанныеДляПроведения.Вставить("ВыполненныеДействия", РезультатыЗапроса[0].Выгрузить());
	
	Возврат ДанныеДляПроведения;

КонецФункции	

Процедура ЗаполнитьВыполняемыеДействия(Основание)
	
	ДополнительныеСвойства.Вставить("ЗаполнитьПараметрыПечати");
	
	Если НЕ ЗначениеЗаполнено(Основание) Тогда
		Возврат;
	КонецЕсли;	
	
	ПараметрыОбъекта = Новый Структура("Организация, Событие, Дата, Проведен");
	ЗаполнитьЗначенияСвойств(ПараметрыОбъекта, ЭтотОбъект);  
	Если ТипЗнч(Основание) = Тип("СправочникСсылка.Сотрудники") Тогда
		ПараметрыОбъекта.Вставить("Сотрудник", Основание);
	Иначе
		ПараметрыОбъекта.Вставить("Основание", Основание);      
	КонецЕсли;
		
	ВыполняемыеДействия.Очистить();
	ДополнительныеПараметрыПечати.Очистить();
	
	ТаблицаВыполняемыеДействия = ВыполняемыеДействия.Выгрузить();
	ТаблицаВыполняемыеДействия.Очистить();
	
	ПараметрыОбъекта.Вставить("ТаблицаВыполняемыеДействия", ТаблицаВыполняемыеДействия);
	
	АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено);
	Документы.бит_ум_ОтчетностьПоИР.ПодготовитьДанныеДляЗаполнения(ПараметрыОбъекта, АдресХранилища);
	
	СтруктураДанных = ПолучитьИзВременногоХранилища(АдресХранилища);
	УдалитьИзВременногоХранилища(АдресХранилища);
	Если ТипЗнч(СтруктураДанных) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;   	
	
	Если СтруктураДанных.Свойство("ТаблицаВыполняемыеДействия") Тогда
		
		ВыполняемыеДействия.Загрузить(СтруктураДанных.ТаблицаВыполняемыеДействия);
		
		КлючСвязи = 0;
		
		Для Каждого СтрокаТаблицы Из ВыполняемыеДействия Цикл
			КлючСвязи = КлючСвязи + 1;
			СтрокаТаблицы.КлючСвязи = КлючСвязи;
		КонецЦикла;
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ЗаполнитьПоДокументуОснованию(Основание)
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ПриемНаРаботу") Тогда
		
		Событие = ПредопределенноеЗначение("Перечисление.бит_ум_ВидыСобытийПоИР.ПриемНаРаботу");
		
		// Заполним реквизиты из стандартного набора по документу основанию.
		бит_ум_ОбщегоНазначения.ЗаполнитьПоОснованию(ЭтотОбъект, Основание, Истина);
		
		// Заполним табличную часть
		ЗаполнитьВыполняемыеДействия(Основание);
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.Увольнение") Тогда
		
		Событие = ПредопределенноеЗначение("Перечисление.бит_ум_ВидыСобытийПоИР.Увольнение");
		
		// Заполним реквизиты из стандартного набора по документу основанию.
		бит_ум_ОбщегоНазначения.ЗаполнитьПоОснованию(ЭтотОбъект, Основание, Истина);
		
		// Заполним табличную часть
		ЗаполнитьВыполняемыеДействия(Основание);     
		
	ИначеЕсли ТипЗнч(Основание) = Тип("СправочникСсылка.Сотрудники") Тогда
		
		Событие = Документы.бит_ум_ОтчетностьПоИР.ОпределитьСобытиеПоСотруднику(Основание);   
		
		// Заполним реквизиты из стандартного набора по документу основанию.
		бит_ум_ОбщегоНазначения.ЗаполнитьПоОснованию(ЭтотОбъект, Основание, Истина); 
		
		Если ЗначениеЗаполнено(Событие) Тогда   
			КадровыеДанные = КадровыйУчет.КадровыеДанныеСотрудников(Истина,
				ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Основание), "Организация", ТекущаяДатаСеанса());
			Организация = КадровыеДанные[0].Организация;
			ЗаполнитьВыполняемыеДействия(Основание);    
		Иначе 
			СтрокаТабличнойЧасти = ВыполняемыеДействия.Добавить();
			СтрокаТабличнойЧасти.Сотрудник = Основание;     
			СтрокаТабличнойЧасти.КлючСвязи = 1;
		КонецЕсли;
		      
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
